app/views/user_mailer/send_bid_receipt.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

    <h1>Hi,
      <%= @bidder.profile.first_name %>