app/views/user_mailer/send_winner_email.html.erb

SELECT  "profiles".* FROM "profiles" INNER JOIN "users" ON "profiles"."id" = "users"."profile_id" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <h1>Hi
      <%= @winner.profile.first_name %>,</h1>