app/views/user_mailer/send_seller_email.html.erb

SELECT  "profiles".* FROM "profiles" INNER JOIN "users" ON "profiles"."id" = "users"."profile_id" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<body>
  <h1>Hi <%= @seller.profile.first_name %>,</h1>