app/views/bids/index.html.erb

        <td>
          <span class="badge badge-default badge-pill"><%= show.bids.count %></span>
---
SELECT "bids".* FROM "bids"
SELECT COUNT(*) FROM "bids"