app/views/bids/show.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<h3> Item Price: <%= number_to_currency(@bid.item.price) %> </h3>
<h3> Total Draw Value: <%= number_to_currency(@bidders.count * @bid.item.price) %> </h3>