app/views/items/show.html.erb

INSERT INTO "bids" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["item_id", 1], ["created_at", 2017-05-08 11:47:05 UTC], ["updated_at", 2017-05-08 11:47:05 UTC]]
---

<p class="text-danger">This draw will begin in <strong><%= distance_of_time_in_words(Time.now, @item.created_at + 7.days) %></strong>. Don't miss out, bid now!</p>