app/controllers/bids_controller.rb

  def index
    @bids = Bid.all
---
SELECT "bids".* FROM "bids"

  def show
    @bidders = @bids.select{ |x| x.item_id == @bid.item_id }.map{ |x| x.user }
    @draw_total = @bidders.count * @bid.item.price
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def send_winner_email
    @winner = Bid.find(params[:winner])
    @item = Item.find(params[:item])
---
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def send_seller_email
    @item = Item.find(params[:item])
    @winner = Bid.find(params[:winner])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @bid = Bid.new(bid_params)

    respond_to do |format|
      if @bid.save
---
INSERT INTO "bids" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["item_id", 2], ["created_at", 2017-05-04 00:49:28 UTC], ["updated_at", 2017-05-04 00:49:28 UTC]]

  def update
    respond_to do |format|
      if @bid.update(bid_params)
---
UPDATE "bids" SET "user_id" = ?, "updated_at" = ? WHERE "bids"."id" = ?  [["user_id", 2], ["updated_at", 2017-05-05 00:21:55 UTC], ["id", 1]]

  def destroy
    @bid.destroy
---
DELETE FROM "bids" WHERE "bids"."id" = ?  [["id", 3]]

    def set_bid
      @bid = Bid.find(params[:id])
---
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def set_bids
      @bids = Bid.all
---
SELECT "bids".* FROM "bids"