app/controllers/charges_controller.rb

  def create
    # Amount in cents
    @item = Item.find(params[:item])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]