app/controllers/charges_controller.rb

INSERT INTO "bids" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["item_id", 1], ["created_at", 2017-05-08 14:15:09 UTC], ["updated_at", 2017-05-08 14:15:09 UTC]]
---
  def create
    # Amount in cents
    @amount = 500


    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Rails Stripe customer',
      :currency    => 'aud',
      :receipt_email => "rafflernotifications@gmail.com",
    )

    # I need to pass through the current @item.id variable in here
    @item = params[:item]
    @bidder = current_user
    @new_bid = Bid.create(user_id: @bidder.id, item_id: @item)