app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT "items".* FROM "items" WHERE (name LIKE '%gold%')

  def create_bid
    @item = params[:item]
    @bidder = current_user
    @new_bid = Bid.create(user_id: @bidder.id, item_id: @item)
---
INSERT INTO "bids" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["item_id", 1], ["created_at", 2017-05-08 12:10:20 UTC], ["updated_at", 2017-05-08 12:10:20 UTC]]

  def create
    @item = Item.new(item_params)
    @item.seller_id = current_user.id

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "shoe"], ["description", "a nice shoe\r\n"], ["created_at", 2017-05-02 03:27:47 UTC], ["updated_at", 2017-05-02 03:27:47 UTC]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "golf set"], ["description", "a fancy golf set"], ["updated_at", 2017-05-02 03:28:05 UTC], ["id", 1]]