app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("username", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "firstuser"], ["first_name", "firstname"], ["last_name", "lastname"], ["created_at", 2017-05-10 06:30:06 UTC], ["updated_at", 2017-05-10 06:30:06 UTC]]