app/controllers/sellers_controller.rb

  def index
    @sellers = Seller.all
---
SELECT "sellers".* FROM "sellers"

  def create
    @seller = Seller.new(seller_params)

    respond_to do |format|
      @seller.user_id = current_user.id
      if @seller.save
---
INSERT INTO "sellers" ("user_id", "seller_rating", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["seller_rating", 5], ["item_id", 1], ["created_at", 2017-05-10 06:49:21 UTC], ["updated_at", 2017-05-10 06:49:21 UTC]]

    def set_seller
      @seller = Seller.find(params[:id])
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]