app/controllers/winners_controller.rb

  def show
    @bidders = @bids.select{ |x| x.item_id == @bid.item_id }.map{ |x| x.user.email }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def send_winner_email
    # this needs to be sent to the winner. Set User.first for testing
    @user = User.first
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def send_seller_notification
    # this needs to be sent to the seller. Set User.first for testing
    @user = User.first
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def set_current_bid
      @bid = Bid.find(params[:id])
---
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def set_all_bids
      @bids = Bid.all
---
SELECT "bids".* FROM "bids"